{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "model", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 11, 14]}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"config": {"recurrent_constraint": null, "stateful": false, "dropout": 0.0, "return_sequences": false, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "time_major": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_regularizer": null, "trainable": true, "dtype": null, "reset_after": false, "name": "gru", "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "selu", "unroll": false, "units": 64, "kernel_regularizer": null}, "class_name": "GRU"}, "name": "bidirectional", "trainable": true}, "name": "bidirectional", "class_name": "Bidirectional"}, {"inbound_nodes": [[["bidirectional", 0, 0, {}]]], "config": {"dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null, "name": "dropout", "trainable": true}, "name": "dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}, "name": "flatten", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"name": "dense", "bias_regularizer": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "linear", "units": 14, "use_bias": true, "activity_regularizer": null}, "name": "dense", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}, "class_name": "Model"}