{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "model", "output_layers": [["dense", 0, 0]], "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 11, 14]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "bidirectional", "config": {"dtype": "float32", "name": "bidirectional", "layer": {"config": {"return_state": false, "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "dtype": null, "recurrent_regularizer": null, "stateful": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "recurrent_dropout": 0.0, "activity_regularizer": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "implementation": 1, "name": "lstm", "time_major": false, "bias_regularizer": null, "trainable": true, "unroll": false, "dropout": 0.0, "kernel_regularizer": null, "return_sequences": false, "go_backwards": false, "activation": "selu", "units": 64}, "class_name": "LSTM"}, "merge_mode": "concat", "trainable": true}, "class_name": "Bidirectional", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout", "config": {"dtype": "float32", "name": "dropout", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"name": "flatten", "config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "dense", "config": {"name": "dense", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 14, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}