{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 11, 14]}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"recurrent_regularizer": null, "recurrent_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "time_major": false, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "implementation": 1, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "stateful": false, "units": 64, "unroll": false, "activity_regularizer": null, "use_bias": true, "return_state": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "activation": "selu", "reset_after": false, "name": "gru", "kernel_regularizer": null}, "class_name": "GRU", "name": "gru"}, {"inbound_nodes": [[["gru", 0, 1, {}]]], "config": {"dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout", "rate": 0.2, "trainable": true}, "class_name": "Dropout", "name": "dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"data_format": "channels_last", "dtype": "float32", "name": "flatten", "trainable": true}, "class_name": "Flatten", "name": "flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 14, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "dense", "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense", "name": "dense"}], "name": "model", "output_layers": [["dense", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf"}