{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 14], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"name": "gru", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "GRU", "config": {"use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "selu", "stateful": false, "unroll": false, "name": "gru", "bias_constraint": null, "implementation": 1, "go_backwards": false, "trainable": true, "reset_after": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_dropout": 0.0, "recurrent_constraint": null, "time_major": false, "units": 64, "bias_regularizer": null, "kernel_constraint": null, "return_sequences": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activity_regularizer": null, "recurrent_regularizer": null, "dtype": "float32", "return_state": true, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "dropout": 0.0}}, {"name": "dropout", "inbound_nodes": [[["gru", 0, 1, {}]]], "class_name": "Dropout", "config": {"noise_shape": null, "dtype": "float32", "seed": null, "trainable": true, "name": "dropout", "rate": 0.2}}, {"name": "flatten", "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "dtype": "float32", "data_format": "channels_last"}}, {"name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense", "bias_constraint": null, "units": 14, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null}}]}}