{"config": {"layers": [{"config": {"batch_input_shape": [null, 11, 14], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"return_sequences": false, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true, "go_backwards": false, "recurrent_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 64, "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm", "return_state": false, "activation": "selu", "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "time_major": false, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "unit_forget_bias": true}, "class_name": "LSTM", "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout", "seed": null, "dtype": "float32", "rate": 0.2}, "class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten"}, "class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense", "activation": "linear", "bias_constraint": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "units": 14, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense", "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["dense", 0, 0]]}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}