{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 11, 14], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm", "config": {"return_sequences": false, "activity_regularizer": null, "name": "lstm", "time_major": false, "implementation": 1, "recurrent_dropout": 0.0, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "recurrent_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "unit_forget_bias": true, "use_bias": true, "unroll": false, "units": 64, "bias_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "activation": "selu", "recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "dropout": 0.0}}, {"class_name": "Dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]], "name": "dropout", "config": {"seed": null, "name": "dropout", "noise_shape": null, "rate": 0.2, "trainable": true, "dtype": "float32"}}, {"class_name": "Flatten", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "flatten", "config": {"dtype": "float32", "name": "flatten", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "units": 14, "bias_constraint": null, "name": "dense", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "activation": "linear", "kernel_regularizer": null, "trainable": true}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]], "name": "model"}}