{"class_name": "Model", "config": {"name": "model", "output_layers": [["add", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 11, 14], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [11, 14, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d", "class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_size": [6, 14], "activation": "linear", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "dtype": "float32", "use_bias": true, "padding": "valid", "filters": 64, "name": "conv2d", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "dtype": "float32"}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [6, 64]}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "config": {"name": "pre_ar_trans", "trainable": true, "dtype": "float32", "hw": 11}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"activation": "selu", "units": 64, "recurrent_constraint": null, "dtype": null, "recurrent_regularizer": null, "return_sequences": false, "name": "lstm", "bias_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "recurrent_activation": "hard_sigmoid", "unroll": false, "implementation": 1, "bias_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "return_state": false, "time_major": false, "use_bias": true, "trainable": true, "dropout": 0.0, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null, "dtype": "float32"}, "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "units": 1, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "units": 14, "trainable": true, "use_bias": true, "dtype": "float32", "name": "dense", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "post_ar_trans", "class_name": "PostARTrans", "config": {"name": "post_ar_trans", "trainable": true, "dtype": "float32", "m": 14}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}