{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4-tf", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 11, 14], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape", "dtype": "float32", "target_shape": [11, 14, 1]}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_size": [6, 14], "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05, "dtype": "float32"}}, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d", "dtype": "float32", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "seed": null, "name": "dropout", "noise_shape": null, "dtype": "float32"}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape_1", "dtype": "float32", "target_shape": [6, 64]}}, {"name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05, "dtype": "float32"}}, "return_sequences": true, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "return_state": true, "bias_regularizer": null, "name": "lstm", "recurrent_dropout": 0.0, "time_major": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "activation": "selu", "units": 64, "unroll": false, "use_bias": true, "trainable": true, "dtype": null, "stateful": false}}, "name": "bidirectional", "merge_mode": "concat", "dtype": "float32"}}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "pre_ar_trans", "hw": 11, "dtype": "float32"}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_regularizer": null, "go_backwards": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05, "dtype": "float32"}}, "return_sequences": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "return_state": false, "bias_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "time_major": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "activation": "selu", "units": 64, "unroll": false, "use_bias": true, "trainable": true, "dtype": null, "stateful": false}}, "name": "bidirectional_1", "merge_mode": "concat", "dtype": "float32"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1", "dtype": "float32"}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "seed": null, "name": "dropout_1", "noise_shape": null, "dtype": "float32"}}, {"name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation", "dtype": "float32"}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten", "dtype": "float32"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_constraint": null, "units": 14, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "name": "dense", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"trainable": true, "name": "post_ar_trans", "m": 14, "dtype": "float32"}}, {"name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"trainable": true, "name": "add", "dtype": "float32"}}], "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]]}}