{"config": {"layers": [{"config": {"batch_input_shape": [null, 11, 14], "dtype": "float32", "name": "input_1", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"trainable": true, "dtype": "float32", "name": "reshape", "target_shape": [11, 14, 1]}, "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape"}, {"config": {"kernel_size": [6, 14], "strides": [1, 1], "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "dtype": "float32", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "filters": 64, "name": "conv2d", "bias_regularizer": null, "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d"}, {"config": {"noise_shape": null, "dtype": "float32", "rate": 0.1, "seed": null, "trainable": true, "name": "dropout"}, "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "dropout"}, {"config": {"trainable": true, "dtype": "float32", "name": "reshape_1", "target_shape": [6, 64]}, "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "reshape_1"}, {"config": {"trainable": true, "merge_mode": "concat", "dtype": "float32", "layer": {"config": {"return_state": true, "recurrent_constraint": null, "stateful": false, "unroll": false, "go_backwards": false, "bias_regularizer": null, "trainable": true, "return_sequences": true, "activation": "selu", "dropout": 0.0, "implementation": 1, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "dtype": null, "unit_forget_bias": true, "time_major": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "name": "lstm", "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 64, "kernel_regularizer": null}, "class_name": "LSTM"}, "name": "bidirectional"}, "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "bidirectional"}, {"config": {"trainable": true, "dtype": "float32", "hw": 11, "name": "pre_ar_trans"}, "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "pre_ar_trans"}, {"config": {"trainable": true, "merge_mode": "concat", "dtype": "float32", "layer": {"config": {"return_state": false, "recurrent_constraint": null, "stateful": false, "unroll": false, "go_backwards": false, "bias_regularizer": null, "trainable": true, "return_sequences": false, "activation": "selu", "dropout": 0.0, "implementation": 1, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "dtype": null, "unit_forget_bias": true, "time_major": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "use_bias": true, "name": "lstm_1", "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "units": 64, "kernel_regularizer": null}, "class_name": "LSTM"}, "name": "bidirectional_1"}, "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "name": "bidirectional_1"}, {"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "name": "flatten_1"}, {"config": {"noise_shape": null, "dtype": "float32", "rate": 0.1, "seed": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "dropout_1"}, {"config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "relu"}, "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "activation"}, {"config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten"}, "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten"}, {"config": {"kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 1}, "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "dense_1"}, {"config": {"kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "name": "dense", "activity_regularizer": null, "kernel_regularizer": null, "units": 14}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense"}, {"config": {"m": 14, "trainable": true, "dtype": "float32", "name": "post_ar_trans"}, "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "post_ar_trans"}, {"config": {"trainable": true, "dtype": "float32", "name": "add"}, "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "name": "add"}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["add", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow"}