{"class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 11, 14], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "reshape", "target_shape": [11, 14, 1], "trainable": true, "dtype": "float32"}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"dtype": "float32", "strides": [1, 1], "trainable": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "kernel_constraint": null, "name": "conv2d", "dilation_rate": [1, 1], "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "filters": 64, "activation": "linear", "kernel_size": [6, 14], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "padding": "valid"}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"name": "dropout", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.1, "dtype": "float32"}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"name": "reshape_1", "target_shape": [6, 64], "trainable": true, "dtype": "float32"}}, {"name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "bidirectional", "layer": {"class_name": "LSTM", "config": {"dropout": 0.0, "trainable": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "name": "lstm", "go_backwards": false, "kernel_regularizer": null, "units": 64, "activation": "selu", "implementation": 1, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "unit_forget_bias": true, "time_major": false, "use_bias": true, "unroll": false, "return_state": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": null}}, "merge_mode": "concat", "trainable": true, "dtype": "float32"}}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "pre_ar_trans", "dtype": "float32", "trainable": true, "hw": 11}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"dropout": 0.0, "trainable": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "name": "lstm_1", "go_backwards": false, "kernel_regularizer": null, "units": 64, "activation": "selu", "implementation": 1, "bias_constraint": null, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "unit_forget_bias": true, "time_major": false, "use_bias": true, "unroll": false, "return_state": false, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": null}}, "merge_mode": "concat", "trainable": true, "dtype": "float32"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.1, "dtype": "float32"}}, {"name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "activation", "activation": "relu", "trainable": true, "dtype": "float32"}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "flatten", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 1, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense", "use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 14, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "post_ar_trans", "m": 14, "trainable": true, "dtype": "float32"}}, {"name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"name": "add", "trainable": true, "dtype": "float32"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["add", 0, 0]]}}