{"keras_version": "2.2.4-tf", "class_name": "Model", "config": {"name": "model", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 11, 14], "dtype": "float32"}, "inbound_nodes": []}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [11, 14, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d", "class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_size": [6, 14], "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}}, "bias_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "dtype": "float32", "activation": "linear", "bias_constraint": null, "name": "conv2d", "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1]}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout", "trainable": true, "noise_shape": null, "dtype": "float32", "seed": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [6, 64]}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"dropout": 0.0, "unit_forget_bias": true, "units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "return_sequences": true, "trainable": true, "return_state": true, "dtype": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "unroll": false, "use_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null, "time_major": false, "name": "lstm", "kernel_constraint": null, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}}, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional", "trainable": true, "dtype": "float32", "merge_mode": "concat"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "config": {"name": "pre_ar_trans", "trainable": true, "hw": 11, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"dropout": 0.0, "unit_forget_bias": true, "units": 64, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "return_sequences": false, "trainable": true, "return_state": false, "dtype": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "unroll": false, "use_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1, "kernel_regularizer": null, "go_backwards": false, "activity_regularizer": null, "recurrent_regularizer": null, "time_major": false, "name": "lstm_1", "kernel_constraint": null, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}}, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional_1", "trainable": true, "dtype": "float32", "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_1", "trainable": true, "noise_shape": null, "dtype": "float32", "seed": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"units": 14, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "activation": "linear", "kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense", "kernel_constraint": null, "use_bias": true, "trainable": true}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "post_ar_trans", "class_name": "PostARTrans", "config": {"name": "post_ar_trans", "trainable": true, "dtype": "float32", "m": 14}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "output_layers": [["add", 0, 0]]}, "backend": "tensorflow"}