System Info:
	Python version: 3.5.2 (default, Oct  8 2019, 13:06:37) 
[GCC 5.4.0 20160609]
	TensorFlow version: 1.14.0
	Keras version: 2.2.4-tf

Training Info:
	Loss Function: mean_absolute_error
	Optimisation Method: SGD
	Learning Rate: 0.05
	Batch Size: 64
	Number of Epochs: 130

Training Results:
	Loss: 0.02210729715203234
	Rse: 0.30019608
	Mean_Absolute_Error: 0.022107441

Validation Results:
	Loss: 0.021633012284083965
	Rse: 0.3106938
	Mean_Absolute_Error: 0.021632962
    
INFO:lstnet:Saving results ...
INFO:lstnet:Validation on the validation set returned: Loss:0.021633, RSE:0.310694, MAE:0.021633
1224516/1224516 [==============================] - 72s 59us/sample - loss: 0.0224 - rse: 0.3083 - mean_absolute_error: 0.0224
INFO:lstnet:Validation on the test set returned: Loss:0.022394, RSE:0.308316, MAE:0.022394

Model Summary:
	Model: "model"
	__________________________________________________________________________________________________
	Layer (type)                    Output Shape         Param #     Connected to                     
	==================================================================================================
	input_1 (InputLayer)            [(None, 11, 14)]     0                                            
	__________________________________________________________________________________________________
	reshape (Reshape)               (None, 11, 14, 1)    0           input_1[0][0]                    
	__________________________________________________________________________________________________
	conv2d (Conv2D)                 (None, 6, 1, 64)     5440        reshape[0][0]                    
	__________________________________________________________________________________________________
	dropout (Dropout)               (None, 6, 1, 64)     0           conv2d[0][0]                     
	__________________________________________________________________________________________________
	reshape_1 (Reshape)             (None, 6, 64)        0           dropout[0][0]                    
	__________________________________________________________________________________________________
	bidirectional (Bidirectional)   [(None, 6, 128), (No 66048       reshape_1[0][0]                  
	__________________________________________________________________________________________________
	pre_ar_trans (PreARTrans)       (None, 11)           0           input_1[0][0]                    
	__________________________________________________________________________________________________
	bidirectional_1 (Bidirectional) (None, 128)          98816       bidirectional[0][0]              
	                                                                 bidirectional[0][1]              
	                                                                 bidirectional[0][2]              
	                                                                 bidirectional[0][3]              
	                                                                 bidirectional[0][4]              
	__________________________________________________________________________________________________
	flatten_1 (Flatten)             (None, 11)           0           pre_ar_trans[0][0]               
	__________________________________________________________________________________________________
	dropout_1 (Dropout)             (None, 128)          0           bidirectional_1[0][0]            
	__________________________________________________________________________________________________
	activation (Activation)         (None, 11)           0           flatten_1[0][0]                  
	__________________________________________________________________________________________________
	flatten (Flatten)               (None, 128)          0           dropout_1[0][0]                  
	__________________________________________________________________________________________________
	dense_1 (Dense)                 (None, 1)            12          activation[0][0]                 
	__________________________________________________________________________________________________
	dense (Dense)                   (None, 14)           1806        flatten[0][0]                    
	__________________________________________________________________________________________________
	post_ar_trans (PostARTrans)     (None, 14)           0           dense_1[0][0]                    
	                                                                 input_1[0][0]                    
	__________________________________________________________________________________________________
	add (Add)                       (None, 14)           0           dense[0][0]                      
	                                                                 post_ar_trans[0][0]              
	==================================================================================================
	Total params: 172,122
	Trainable params: 172,122
	Non-trainable params: 0
	__________________________________________________________________________________________________
