{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["add", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 11, 14], "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Reshape", "config": {"dtype": "float32", "target_shape": [11, 14, 1], "name": "reshape", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape"}, {"class_name": "Conv2D", "config": {"filters": 64, "bias_regularizer": null, "name": "conv2d", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null, "trainable": true, "dtype": "float32", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "kernel_size": [6, 14], "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "dtype": "float32", "mean": 0.0, "stddev": 0.05}}, "data_format": "channels_last", "strides": [1, 1]}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d"}, {"class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "name": "dropout", "rate": 0.2, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "dropout"}, {"class_name": "Reshape", "config": {"dtype": "float32", "target_shape": [6, 64], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "reshape_1"}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "layer": {"class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "units": 64, "dtype": null, "return_sequences": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "unroll": false, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "dtype": "float32", "mean": 0.0, "stddev": 0.05}}, "name": "lstm", "kernel_constraint": null, "go_backwards": false, "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "time_major": false, "return_state": true, "activity_regularizer": null, "activation": "selu", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional", "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "bidirectional"}, {"class_name": "PreARTrans", "config": {"dtype": "float32", "name": "pre_ar_trans", "trainable": true, "hw": 11}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "pre_ar_trans"}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "layer": {"class_name": "LSTM", "config": {"bias_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "units": 64, "dtype": null, "return_sequences": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "unroll": false, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "dtype": "float32", "mean": 0.0, "stddev": 0.05}}, "name": "lstm_1", "kernel_constraint": null, "go_backwards": false, "use_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "unit_forget_bias": true, "stateful": false, "time_major": false, "return_state": false, "activity_regularizer": null, "activation": "selu", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional_1", "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "name": "bidirectional_1"}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dropout", "config": {"dtype": "float32", "seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null, "trainable": true}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "name": "activation", "activation": "relu", "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "activation"}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten"}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "units": 1, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}, "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense", "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "units": 14, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}, "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense"}, {"class_name": "PostARTrans", "config": {"dtype": "float32", "name": "post_ar_trans", "trainable": true, "m": 14}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "post_ar_trans"}, {"class_name": "Add", "config": {"dtype": "float32", "name": "add", "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "name": "add"}]}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}