{"class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 11, 9], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Reshape", "name": "reshape", "config": {"target_shape": [11, 9, 1], "name": "reshape", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d", "config": {"padding": "valid", "filters": 64, "name": "conv2d", "trainable": true, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "bias_constraint": null, "dtype": "float32", "kernel_size": [6, 9]}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout", "config": {"name": "dropout", "rate": 0.2, "trainable": true, "noise_shape": null, "dtype": "float32", "seed": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"target_shape": [6, 64], "name": "reshape_1", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Bidirectional", "name": "bidirectional", "config": {"name": "bidirectional", "layer": {"class_name": "LSTM", "config": {"use_bias": true, "name": "lstm", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "units": 64, "dtype": null, "bias_constraint": null, "return_state": true, "trainable": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "dropout": 0.0, "time_major": false, "activation": "selu", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "stateful": false, "implementation": 1, "activity_regularizer": null}}, "dtype": "float32", "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "PreARTrans", "name": "pre_ar_trans", "config": {"hw": 11, "name": "pre_ar_trans", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "name": "bidirectional_1", "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"use_bias": true, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "units": 64, "dtype": null, "bias_constraint": null, "return_state": false, "trainable": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_constraint": null, "dropout": 0.0, "time_major": false, "activation": "selu", "recurrent_dropout": 0.0, "kernel_constraint": null, "unroll": false, "stateful": false, "implementation": 1, "activity_regularizer": null}}, "dtype": "float32", "trainable": true, "merge_mode": "concat"}, "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null, "dtype": "float32", "seed": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation", "config": {"activation": "relu", "name": "activation", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"use_bias": true, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 1, "dtype": "float32", "activity_regularizer": null}, "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense", "config": {"use_bias": true, "name": "dense", "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 9, "dtype": "float32", "activity_regularizer": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "PostARTrans", "name": "post_ar_trans", "config": {"m": 9, "name": "post_ar_trans", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add", "config": {"name": "add", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "name": "model", "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]]}}