{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 11, 9], "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "name": "reshape", "dtype": "float32", "target_shape": [11, 9, 1]}, "name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [6, 9], "filters": 64, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "dtype": "float32", "stddev": 0.05}, "class_name": "RandomNormal"}, "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "conv2d", "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true}, "name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "name": "dropout", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "reshape_1", "dtype": "float32", "target_shape": [6, 64]}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"config": {"layer": {"config": {"time_major": false, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "return_sequences": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "dtype": "float32", "stddev": 0.05}, "class_name": "RandomNormal"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "unit_forget_bias": true, "name": "lstm", "recurrent_dropout": 0.0, "use_bias": true, "recurrent_constraint": null, "bias_constraint": null, "return_state": true, "unroll": false, "kernel_regularizer": null, "dtype": null, "units": 64, "stateful": false, "activity_regularizer": null, "implementation": 1, "go_backwards": false, "trainable": true}, "class_name": "LSTM"}, "name": "bidirectional", "dtype": "float32", "merge_mode": "concat", "trainable": true}, "name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"hw": 11, "name": "pre_ar_trans", "dtype": "float32", "trainable": true}, "name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"layer": {"config": {"time_major": false, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "return_sequences": false, "kernel_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "dtype": "float32", "stddev": 0.05}, "class_name": "RandomNormal"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "unit_forget_bias": true, "name": "lstm_1", "recurrent_dropout": 0.0, "use_bias": true, "recurrent_constraint": null, "bias_constraint": null, "return_state": false, "unroll": false, "kernel_regularizer": null, "dtype": null, "units": 64, "stateful": false, "activity_regularizer": null, "implementation": 1, "go_backwards": false, "trainable": true}, "class_name": "LSTM"}, "name": "bidirectional_1", "dtype": "float32", "merge_mode": "concat", "trainable": true}, "name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"config": {"name": "flatten_1", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"config": {"noise_shape": null, "rate": 0.1, "name": "dropout_1", "seed": null, "dtype": "float32", "trainable": true}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "name": "activation", "dtype": "float32", "trainable": true}, "name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 1, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "dtype": "float32", "trainable": true}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 9, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense", "kernel_regularizer": null, "dtype": "float32", "trainable": true}, "name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"m": 9, "name": "post_ar_trans", "dtype": "float32", "trainable": true}, "name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"config": {"name": "add", "dtype": "float32", "trainable": true}, "name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "name": "model", "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Model"}