{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 11, 9], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"target_shape": [11, 9, 1], "dtype": "float32", "trainable": true, "name": "reshape"}, "class_name": "Reshape", "name": "reshape"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"bias_constraint": null, "dtype": "float32", "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "name": "conv2d", "kernel_size": [6, 9], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "bias_regularizer": null, "strides": [1, 1], "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d"}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "dropout", "noise_shape": null, "rate": 0.1, "seed": null}, "class_name": "Dropout", "name": "dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"target_shape": [6, 64], "dtype": "float32", "trainable": true, "name": "reshape_1"}, "class_name": "Reshape", "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"merge_mode": "concat", "dtype": "float32", "trainable": true, "layer": {"config": {"bias_constraint": null, "implementation": 1, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 64, "kernel_regularizer": null, "return_sequences": true, "go_backwards": false, "return_state": true, "unit_forget_bias": true, "unroll": false, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "time_major": false, "dtype": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm", "stateful": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true}, "class_name": "LSTM"}, "name": "bidirectional"}, "class_name": "Bidirectional", "name": "bidirectional"}, {"inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"merge_mode": "concat", "dtype": "float32", "trainable": true, "layer": {"config": {"bias_constraint": null, "implementation": 1, "activity_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 64, "kernel_regularizer": null, "return_sequences": false, "go_backwards": false, "return_state": false, "unit_forget_bias": true, "unroll": false, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "time_major": false, "dtype": null, "dropout": 0.0, "kernel_constraint": null, "name": "lstm_1", "stateful": false, "recurrent_constraint": null, "kernel_initializer": {"config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "use_bias": true, "recurrent_dropout": 0.0, "trainable": true}, "class_name": "LSTM"}, "name": "bidirectional_1"}, "class_name": "Bidirectional", "name": "bidirectional_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"hw": 11, "dtype": "float32", "trainable": true, "name": "pre_ar_trans"}, "class_name": "PreARTrans", "name": "pre_ar_trans"}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.1, "seed": null}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten", "name": "flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "units": 9, "kernel_regularizer": null, "name": "dense", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activation": "linear", "use_bias": true}, "class_name": "Dense", "name": "dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "post_ar_trans", "dtype": "float32", "m": 9, "trainable": true}, "class_name": "PostARTrans", "name": "post_ar_trans"}, {"inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "add"}, "class_name": "Add", "name": "add"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["add", 0, 0]], "name": "model"}, "class_name": "Model"}