{"class_name": "Model", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 11, 9], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Reshape", "name": "reshape", "config": {"trainable": true, "target_shape": [11, 9, 1], "name": "reshape", "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d", "config": {"trainable": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "name": "conv2d", "dtype": "float32", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_size": [6, 9], "filters": 64}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "name": "dropout", "noise_shape": null, "seed": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "target_shape": [6, 64], "name": "reshape_1", "dtype": "float32"}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Bidirectional", "name": "bidirectional", "config": {"trainable": true, "name": "bidirectional", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"trainable": true, "stateful": false, "dropout": 0.0, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "units": 64, "unroll": false, "name": "lstm", "recurrent_dropout": 0.0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "go_backwards": false, "bias_constraint": null, "kernel_constraint": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "dtype": null, "recurrent_constraint": null, "unit_forget_bias": true, "time_major": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "return_state": true, "return_sequences": true}}, "dtype": "float32"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "name": "bidirectional_1", "config": {"trainable": true, "name": "bidirectional_1", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"trainable": true, "stateful": false, "dropout": 0.0, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "units": 64, "unroll": false, "name": "lstm_1", "recurrent_dropout": 0.0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "go_backwards": false, "bias_constraint": null, "kernel_constraint": null, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "dtype": null, "recurrent_constraint": null, "unit_forget_bias": true, "time_major": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "activity_regularizer": null, "recurrent_regularizer": null, "return_state": false, "return_sequences": false}}, "dtype": "float32"}, "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"class_name": "PreARTrans", "name": "pre_ar_trans", "config": {"trainable": true, "name": "pre_ar_trans", "hw": 11, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "name": "dropout_1", "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten", "config": {"trainable": true, "name": "flatten", "data_format": "channels_last", "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "dtype": "float32", "units": 1, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "dtype": "float32", "units": 9, "name": "dense", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "PostARTrans", "name": "post_ar_trans", "config": {"trainable": true, "name": "post_ar_trans", "m": 9, "dtype": "float32"}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Add", "name": "add", "config": {"trainable": true, "name": "add", "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "name": "model", "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}