{"keras_version": "2.2.4-tf", "config": {"output_layers": [["add", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 11, 9], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"dtype": "float32", "trainable": true, "name": "reshape", "target_shape": [11, 9, 1]}, "class_name": "Reshape", "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"dilation_rate": [1, 1], "use_bias": true, "activation": "linear", "filters": 64, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [6, 9], "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "dtype": "float32", "padding": "valid", "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "strides": [1, 1], "name": "conv2d", "data_format": "channels_last"}, "class_name": "Conv2D", "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"config": {"seed": null, "trainable": true, "dtype": "float32", "noise_shape": null, "rate": 0.2, "name": "dropout"}, "class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"config": {"dtype": "float32", "trainable": true, "name": "reshape_1", "target_shape": [6, 64]}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"config": {"layer": {"config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "dropout": 0.0, "trainable": true, "implementation": 1, "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "stateful": false, "use_bias": true, "activation": "relu", "recurrent_regularizer": null, "kernel_constraint": null, "units": 64, "return_state": true, "return_sequences": true, "bias_regularizer": null, "unroll": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "time_major": false, "unit_forget_bias": true, "dtype": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "name": "lstm", "activity_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional", "dtype": "float32"}, "class_name": "Bidirectional", "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"layer": {"config": {"kernel_regularizer": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "dropout": 0.0, "trainable": true, "implementation": 1, "bias_constraint": null, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "stateful": false, "use_bias": true, "activation": "relu", "recurrent_regularizer": null, "kernel_constraint": null, "units": 64, "return_state": false, "return_sequences": false, "bias_regularizer": null, "unroll": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "time_major": false, "unit_forget_bias": true, "dtype": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "name": "lstm_1", "activity_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_1", "dtype": "float32"}, "class_name": "Bidirectional", "name": "bidirectional_1", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"config": {"hw": 11, "trainable": true, "name": "pre_ar_trans", "dtype": "float32"}, "class_name": "PreARTrans", "name": "pre_ar_trans", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"seed": null, "trainable": true, "dtype": "float32", "noise_shape": null, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "units": 9, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "dense", "activity_regularizer": null}, "class_name": "Dense", "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"m": 9, "trainable": true, "name": "post_ar_trans", "dtype": "float32"}, "class_name": "PostARTrans", "name": "post_ar_trans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add", "dtype": "float32"}, "class_name": "Add", "name": "add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "name": "model", "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}