{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 11, 9], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "target_shape": [11, 9, 1], "dtype": "float32", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d", "class_name": "Conv2D", "config": {"kernel_constraint": null, "data_format": "channels_last", "kernel_size": [6, 9], "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d", "trainable": true, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "filters": 64, "padding": "valid", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "dropout", "class_name": "Dropout", "config": {"name": "dropout", "dtype": "float32", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "target_shape": [6, 64], "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional", "dtype": "float32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "dtype": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "time_major": false, "return_sequences": true, "name": "lstm", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unroll": false, "dropout": 0.0, "implementation": 1, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}}, "go_backwards": false, "stateful": false, "activation": "relu", "bias_regularizer": null, "units": 64, "return_state": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"merge_mode": "concat", "name": "bidirectional_1", "dtype": "float32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "dtype": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "time_major": false, "return_sequences": false, "name": "lstm_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unroll": false, "dropout": 0.0, "implementation": 1, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "dtype": "float32", "seed": null, "stddev": 0.05}}, "go_backwards": false, "stateful": false, "activation": "relu", "bias_regularizer": null, "units": 64, "return_state": false, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}}, "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "config": {"hw": 11, "name": "pre_ar_trans", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "rate": 0.1, "seed": null, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"dtype": "float32", "units": 1, "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense", "class_name": "Dense", "config": {"dtype": "float32", "units": 9, "name": "dense", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "post_ar_trans", "class_name": "PostARTrans", "config": {"name": "post_ar_trans", "dtype": "float32", "trainable": true, "m": 9}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "dtype": "float32", "trainable": true}, "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["add", 0, 0]]}, "class_name": "Model"}