{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 11, 9], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"class_name": "Reshape", "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"target_shape": [11, 9, 1], "name": "reshape", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "conv2d", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "padding": "valid", "use_bias": true, "filters": 64, "kernel_size": [6, 9], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32"}}, {"class_name": "Dropout", "name": "dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout", "dtype": "float32", "noise_shape": null}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"target_shape": [6, 64], "name": "reshape_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "return_state": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "implementation": 1, "go_backwards": false, "units": 64, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "stateful": false, "recurrent_dropout": 0.0, "time_major": false, "name": "lstm", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": null, "kernel_constraint": null, "return_sequences": true, "activity_regularizer": null, "activation": "selu", "unroll": false}}, "name": "bidirectional", "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "PreARTrans", "name": "pre_ar_trans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "pre_ar_trans", "trainable": true, "dtype": "float32", "hw": 11}}, {"class_name": "Bidirectional", "name": "bidirectional_1", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "bias_constraint": null, "unit_forget_bias": true, "return_state": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "implementation": 1, "go_backwards": false, "units": 64, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "stateful": false, "recurrent_dropout": 0.0, "time_major": false, "name": "lstm_1", "trainable": true, "recurrent_regularizer": null, "recurrent_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": null, "kernel_constraint": null, "return_sequences": false, "activity_regularizer": null, "activation": "selu", "unroll": false}}, "name": "bidirectional_1", "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1", "dtype": "float32", "noise_shape": null}}, {"class_name": "Activation", "name": "activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "activation", "activation": "relu", "trainable": true, "dtype": "float32"}}, {"class_name": "Flatten", "name": "flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"units": 1, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "dtype": "float32"}}, {"class_name": "Dense", "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"units": 9, "trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "dtype": "float32"}}, {"class_name": "PostARTrans", "name": "post_ar_trans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"m": 9, "name": "post_ar_trans", "trainable": true, "dtype": "float32"}}, {"class_name": "Add", "name": "add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"name": "add", "trainable": true, "dtype": "float32"}}], "output_layers": [["add", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}