{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["add", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 11, 9], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape", "config": {"dtype": "float32", "name": "reshape", "target_shape": [11, 9, 1], "trainable": true}}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d", "config": {"dtype": "float32", "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "conv2d", "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "strides": [1, 1], "kernel_size": [6, 9], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}}}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout", "rate": 0.1, "trainable": true}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"dtype": "float32", "name": "reshape_1", "target_shape": [6, 64], "trainable": true}}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Bidirectional", "name": "bidirectional", "config": {"name": "bidirectional", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"dtype": null, "use_bias": true, "kernel_constraint": null, "go_backwards": false, "units": 64, "activity_regularizer": null, "stateful": false, "time_major": false, "name": "lstm", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "return_sequences": true, "unroll": false, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "dropout": 0.0, "return_state": true, "recurrent_constraint": null}}, "trainable": true, "merge_mode": "concat"}}, {"inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "class_name": "Bidirectional", "name": "bidirectional_1", "config": {"name": "bidirectional_1", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"dtype": null, "use_bias": true, "kernel_constraint": null, "go_backwards": false, "units": 64, "activity_regularizer": null, "stateful": false, "time_major": false, "name": "lstm_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "return_sequences": false, "unroll": false, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "recurrent_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "dropout": 0.0, "return_state": false, "recurrent_constraint": null}}, "trainable": true, "merge_mode": "concat"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "PreARTrans", "name": "pre_ar_trans", "config": {"hw": 11, "dtype": "float32", "name": "pre_ar_trans", "trainable": true}}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.1, "trainable": true}}, {"inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"dtype": "float32", "use_bias": true, "kernel_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "name": "dense", "config": {"dtype": "float32", "use_bias": true, "kernel_constraint": null, "units": 9, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "name": "dense", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "PostARTrans", "name": "post_ar_trans", "config": {"dtype": "float32", "m": 9, "name": "post_ar_trans", "trainable": true}}, {"inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "class_name": "Add", "name": "add", "config": {"dtype": "float32", "name": "add", "trainable": true}}], "name": "model"}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}