{"class_name": "Model", "config": {"output_layers": [["add", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11, 9], "name": "input_1", "dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [11, 9, 1], "name": "reshape", "dtype": "float32"}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "conv2d", "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "dtype": "float32", "trainable": true, "kernel_size": [6, 9], "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "dtype": "float32", "stddev": 0.05}}}, "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2}, "name": "dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [6, 64], "name": "reshape_1", "dtype": "float32"}, "name": "reshape_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"trainable": true, "merge_mode": "concat", "name": "bidirectional", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"time_major": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "trainable": true, "implementation": 1, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "return_state": true, "return_sequences": true, "activity_regularizer": null, "bias_constraint": null, "name": "lstm", "dtype": null, "unroll": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "dtype": "float32", "stddev": 0.05}}, "recurrent_constraint": null, "use_bias": true, "units": 64}}}, "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"trainable": true, "merge_mode": "concat", "name": "bidirectional_1", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"time_major": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "relu", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "recurrent_dropout": 0.0, "kernel_constraint": null, "unit_forget_bias": true, "trainable": true, "implementation": 1, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "return_state": false, "return_sequences": false, "activity_regularizer": null, "bias_constraint": null, "name": "lstm_1", "dtype": null, "unroll": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "dtype": "float32", "stddev": 0.05}}, "recurrent_constraint": null, "use_bias": true, "units": 64}}}, "name": "bidirectional_1", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"class_name": "PreARTrans", "config": {"trainable": true, "dtype": "float32", "name": "pre_ar_trans", "hw": 11}, "name": "pre_ar_trans", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "dtype": "float32", "seed": null, "trainable": true, "rate": 0.2}, "name": "dropout_1", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}, "name": "flatten_1", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}, "name": "flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "units": 1, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "name": "dense", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "dtype": "float32", "trainable": true, "units": 9, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "PostARTrans", "config": {"trainable": true, "name": "post_ar_trans", "dtype": "float32", "m": 9}, "name": "post_ar_trans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add", "dtype": "float32"}, "name": "add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "name": "model", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}