{"keras_version": "2.2.4-tf", "backend": "tensorflow", "config": {"output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 6, 9], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"target_shape": [6, 9, 1], "trainable": true, "dtype": "float32", "name": "reshape"}, "class_name": "Reshape", "name": "reshape"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "padding": "valid", "dtype": "float32", "name": "conv2d", "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_size": [6, 9], "filters": 64, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D", "name": "conv2d"}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"rate": 0.1, "trainable": true, "seed": null, "dtype": "float32", "name": "dropout", "noise_shape": null}, "class_name": "Dropout", "name": "dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"target_shape": [1, 64], "trainable": true, "dtype": "float32", "name": "reshape_1"}, "class_name": "Reshape", "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"merge_mode": "concat", "layer": {"config": {"units": 64, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm", "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "implementation": 1, "stateful": false, "activity_regularizer": null, "time_major": false, "unroll": false, "unit_forget_bias": true, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "dtype": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "recurrent_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_sequences": true, "return_state": true, "bias_constraint": null}, "class_name": "LSTM"}, "trainable": true, "dtype": "float32", "name": "bidirectional"}, "class_name": "Bidirectional", "name": "bidirectional"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "hw": 6, "name": "pre_ar_trans"}, "class_name": "PreARTrans", "name": "pre_ar_trans"}, {"inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"merge_mode": "concat", "layer": {"config": {"units": 64, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "dropout": 0.0, "recurrent_constraint": null, "implementation": 1, "stateful": false, "activity_regularizer": null, "time_major": false, "unroll": false, "unit_forget_bias": true, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "RandomNormal"}, "dtype": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "recurrent_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_sequences": false, "return_state": false, "bias_constraint": null}, "class_name": "LSTM"}, "trainable": true, "dtype": "float32", "name": "bidirectional_1"}, "class_name": "Bidirectional", "name": "bidirectional_1"}, {"inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"rate": 0.1, "trainable": true, "seed": null, "dtype": "float32", "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout", "name": "dropout_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation", "activation": "relu", "dtype": "float32"}, "class_name": "Activation", "name": "activation"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "dtype": "float32", "name": "flatten"}, "class_name": "Flatten", "name": "flatten"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "name": "dense", "kernel_regularizer": null, "kernel_constraint": null, "units": 9, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "dtype": "float32", "bias_constraint": null}, "class_name": "Dense", "name": "dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"m": 9, "trainable": true, "dtype": "float32", "name": "post_ar_trans"}, "class_name": "PostARTrans", "name": "post_ar_trans"}, {"inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "add"}, "class_name": "Add", "name": "add"}], "name": "model"}, "class_name": "Model"}