{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 15, 9], "name": "input_1", "dtype": "float32"}}, {"class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape", "config": {"trainable": true, "target_shape": [15, 9, 1], "name": "reshape", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "conv2d", "config": {"trainable": true, "kernel_regularizer": null, "name": "conv2d", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}}, "dilation_rate": [1, 1], "filters": 64, "dtype": "float32", "kernel_size": [6, 9], "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "padding": "valid", "activation": "linear"}}, {"class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "name": "dropout", "config": {"trainable": true, "name": "dropout", "noise_shape": null, "seed": null, "rate": 0.1, "dtype": "float32"}}, {"class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "reshape_1", "config": {"trainable": true, "target_shape": [10, 64], "name": "reshape_1", "dtype": "float32"}}, {"class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "name": "bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"trainable": true, "kernel_regularizer": null, "unroll": false, "name": "lstm", "bias_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "time_major": false, "dtype": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": true, "use_bias": true, "recurrent_regularizer": null, "return_state": true, "recurrent_dropout": 0.0, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}}, "units": 64, "dropout": 0.0, "kernel_constraint": null, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null}}, "merge_mode": "concat", "name": "bidirectional", "dtype": "float32"}}, {"class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "pre_ar_trans", "config": {"trainable": true, "name": "pre_ar_trans", "hw": 11, "dtype": "float32"}}, {"class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "name": "bidirectional_1", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"trainable": true, "kernel_regularizer": null, "unroll": false, "name": "lstm_1", "bias_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "time_major": false, "dtype": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": false, "use_bias": true, "recurrent_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}}, "units": 64, "dropout": 0.0, "kernel_constraint": null, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null}}, "merge_mode": "concat", "name": "bidirectional_1", "dtype": "float32"}}, {"class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "dtype": "float32", "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.1, "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "activation", "config": {"trainable": true, "dtype": "float32", "activation": "relu", "name": "activation"}}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "flatten", "config": {"trainable": true, "dtype": "float32", "name": "flatten", "data_format": "channels_last"}}, {"class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "dense_1", "config": {"trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "units": 1, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activation": "linear"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "dense", "config": {"trainable": true, "kernel_regularizer": null, "name": "dense", "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "units": 9, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activation": "linear"}}, {"class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "post_ar_trans", "config": {"trainable": true, "m": 9, "name": "post_ar_trans", "dtype": "float32"}}, {"class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "name": "add", "config": {"trainable": true, "name": "add", "dtype": "float32"}}], "output_layers": [["add", 0, 0]], "name": "model", "input_layers": [["input_1", 0, 0]]}}