{"config": {"name": "model", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 15, 9], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "reshape", "dtype": "float32", "target_shape": [15, 9, 1], "trainable": true}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_size": [6, 9], "dilation_rate": [1, 1], "name": "conv2d", "kernel_initializer": {"config": {"dtype": "float32", "stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "padding": "valid", "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_constraint": null}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"name": "dropout", "dtype": "float32", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"name": "reshape_1", "dtype": "float32", "target_shape": [10, 64], "trainable": true}}, {"name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "bidirectional", "dtype": "float32", "merge_mode": "concat", "layer": {"config": {"unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_dropout": 0.0, "dtype": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "time_major": false, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 64, "recurrent_regularizer": null, "return_sequences": true, "go_backwards": false, "return_state": true, "implementation": 1, "kernel_initializer": {"config": {"dtype": "float32", "stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "lstm", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true}}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "pre_ar_trans", "dtype": "float32", "trainable": true, "hw": 15}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"name": "bidirectional_1", "dtype": "float32", "merge_mode": "concat", "layer": {"config": {"unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_dropout": 0.0, "dtype": null, "recurrent_activation": "hard_sigmoid", "activation": "selu", "time_major": false, "stateful": false, "dropout": 0.0, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "units": 64, "recurrent_regularizer": null, "return_sequences": false, "go_backwards": false, "return_state": false, "implementation": 1, "kernel_initializer": {"config": {"dtype": "float32", "stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "name": "lstm_1", "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"name": "flatten_1", "dtype": "float32", "data_format": "channels_last", "trainable": true}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"name": "dropout_1", "dtype": "float32", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}}, {"name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "activation", "dtype": "float32", "activation": "relu", "trainable": true}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "flatten", "dtype": "float32", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 1, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "units": 9, "trainable": true, "name": "dense", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "post_ar_trans", "dtype": "float32", "m": 9, "trainable": true}}, {"name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"name": "add", "dtype": "float32", "trainable": true}}], "output_layers": [["add", 0, 0]]}, "class_name": "Model", "keras_version": "2.2.4-tf", "backend": "tensorflow"}