{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 15, 9], "sparse": false, "dtype": "float32"}}, {"name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [15, 9, 1]}}, {"name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_size": [6, 9], "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d", "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "dtype": "float32", "seed": null, "mean": 0.0}}, "data_format": "channels_last", "dtype": "float32", "filters": 64}}, {"name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "name": "dropout", "dtype": "float32", "seed": null}}, {"name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [10, 64]}}, {"name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"name": "bidirectional", "layer": {"class_name": "LSTM", "config": {"units": 64, "stateful": false, "kernel_regularizer": null, "kernel_constraint": null, "return_sequences": true, "return_state": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "dtype": "float32", "seed": null, "mean": 0.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "dropout": 0.0, "time_major": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "trainable": true, "name": "lstm", "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "dtype": null}}, "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "pre_ar_trans", "trainable": true, "dtype": "float32", "hw": 15}}, {"name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]], "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"units": 64, "stateful": false, "kernel_regularizer": null, "kernel_constraint": null, "return_sequences": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "bias_constraint": null, "activation": "selu", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "dtype": "float32", "seed": null, "mean": 0.0}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "dropout": 0.0, "time_major": false, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "use_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null, "trainable": true, "name": "lstm_1", "go_backwards": false, "implementation": 1, "recurrent_regularizer": null, "dtype": null}}, "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "name": "dropout_1", "dtype": "float32", "seed": null}}, {"name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "units": 1, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "dtype": "float32"}}, {"name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "units": 9, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "linear", "name": "dense", "dtype": "float32"}}, {"name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"name": "post_ar_trans", "m": 9, "trainable": true, "dtype": "float32"}}, {"name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]], "config": {"name": "add", "trainable": true, "dtype": "float32"}}], "output_layers": [["add", 0, 0]], "input_layers": [["input_1", 0, 0]]}}