{"config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 11, 10], "name": "input_1", "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"target_shape": [11, 10, 1], "trainable": true, "name": "reshape", "dtype": "float32"}, "name": "reshape", "class_name": "Reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"kernel_size": [6, 10], "trainable": true, "padding": "valid", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d", "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}, "activity_regularizer": null, "use_bias": true, "filters": 64, "activation": "linear", "bias_constraint": null, "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "conv2d", "class_name": "Conv2D", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "name": "dropout", "seed": null}, "name": "dropout", "class_name": "Dropout", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"config": {"target_shape": [6, 64], "trainable": true, "name": "reshape_1", "dtype": "float32"}, "name": "reshape_1", "class_name": "Reshape", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "bidirectional", "dtype": "float32", "layer": {"config": {"activation": "selu", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 1, "unit_forget_bias": true, "units": 64, "dtype": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_state": true, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": true, "recurrent_regularizer": null, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "time_major": false, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "name": "lstm"}, "class_name": "LSTM"}, "merge_mode": "concat"}, "name": "bidirectional", "class_name": "Bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "pre_ar_trans", "dtype": "float32", "hw": 11}, "name": "pre_ar_trans", "class_name": "PreARTrans", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "bidirectional_1", "dtype": "float32", "layer": {"config": {"activation": "selu", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "unroll": false, "implementation": 1, "unit_forget_bias": true, "units": 64, "dtype": null, "activity_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_state": false, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "recurrent_regularizer": null, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "time_major": false, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}, "use_bias": true, "name": "lstm_1"}, "class_name": "LSTM"}, "merge_mode": "concat"}, "name": "bidirectional_1", "class_name": "Bidirectional", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 0, 1, {}], ["bidirectional", 0, 2, {}], ["bidirectional", 0, 3, {}], ["bidirectional", 0, 4, {}]]]}, {"config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["pre_ar_trans", 0, 0, {}]]]}, {"config": {"trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "name": "dropout_1", "seed": null}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"config": {"activation": "relu", "trainable": true, "name": "activation", "dtype": "float32"}, "name": "activation", "class_name": "Activation", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten", "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"activation": "linear", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 1, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"config": {"activation": "linear", "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 10, "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "use_bias": true, "name": "dense", "bias_constraint": null}, "name": "dense", "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "post_ar_trans", "dtype": "float32", "m": 10}, "name": "post_ar_trans", "class_name": "PostARTrans", "inbound_nodes": [[["dense_1", 0, 0, {}], ["input_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add", "dtype": "float32"}, "name": "add", "class_name": "Add", "inbound_nodes": [[["dense", 0, 0, {}], ["post_ar_trans", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model", "output_layers": [["add", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Model"}